import React, {useState} from 'react';
import App from "../../components/layouts/app";
import Image from "next/image";
import styles from "../../styles/news.module.css"
import ItemOther from "../../components/news/itemOther";
import Gallery from "../../components/gallery/gallery";
import Events from "../../components/events/events";
import stylesHome from "../../styles/Home.module.css"

const Title = () => {
    const [news, setNews] = useState([
        {
            id: 1,
            title: "Այց Ա. Թամանյանի անվան Ճարտարապետության ազգային թանգարան-ինստիտուտ",
            image: "https://eua.am/storage/images/X1KnLxpomajZsqjLO5Ryhf0WeSRWY9WjR9UJpf16.png"
        },
        {
            id: 2,
            title: "Այց Ա. Թամանյանի անվան Ճարտարապետության ազգային թանգարան-ինստիտուտ",
            image: "https://eua.am/storage/images/3vUuc8Ij2jkTsGrO3RGY54EPnUjidwhqoSV9u9cN.png"
        },
        {
            id: 3,
            title: "Այց Ա. Թամանյանի անվան Ճարտարապետության ազգային թանգարան-ինստիտուտ",
            image: "https://eua.am/storage/images/X1KnLxpomajZsqjLO5Ryhf0WeSRWY9WjR9UJpf16.png"
        },
        {
            id: 4,
            title: "Այց Ա. Թամանյանի անվան Ճարտարապետության ազգային թանգարան-ինստիտուտ",
            image: "https://eua.am/storage/images/X1KnLxpomajZsqjLO5Ryhf0WeSRWY9WjR9UJpf16.png"
        },
        {
            id: 5,
            title: "Այց Ա. Թամանյանի անվան Ճարտարապետության ազգային թանգարան-ինստիտուտ",
            image: "https://eua.am/storage/images/X1KnLxpomajZsqjLO5Ryhf0WeSRWY9WjR9UJpf16.png"
        },
        {
            id: 6,
            title: "Այց Ա. Թամանյանի անվան Ճարտարապետության ազգային թանգարան-ինստիտուտ",
            image: "https://eua.am/storage/images/X1KnLxpomajZsqjLO5Ryhf0WeSRWY9WjR9UJpf16.png"
        },
    ])
    return (
        <>
            <App>
                <div className={styles.rowSingle}>
                    <div className={styles.newsContentSingle}>
                        <Image src="https://eua.am/storage/images/QJKzq8v9sWx3JQqSbYWxAAcYnedj0MWZXMLcbyDV.png"
                               width={1000} height={500} alt={"News title"}/>
                        <h1>ՀԵՀ մասնակցեց Հայաստանում Բրիտանական Խորհրդի նախաձեռնությամբ կազմակերված
                            հանդիպում-քննարկմանը</h1>
                        <p>Հայաստանում Բրիտանական Խորհրդի նախաձեռնությամբ կազմակերված «Դասավանդիր հանուն հաջողության»
                            անգլերեն դասավանդողների համաժողովի շրջանակներում Բրիտանական խորհուրդը սույն թվականի մարտի
                            1-ին նախաձեռնել էր հանդիպում-քննարկում ՀՀ բարձրագույն ուսումնական հաստատությունների ագլերեն
                            լեզվի կրթական ծրագրերի ղեկավարների հետ։ Հանդիպմանը մասնակցում էր նաև Հայաստանի եվրոպական
                            համալսարանի կիրառական լեզվաբանության ամբիոնի վարիչ, բ.գ.թ., դոցենտ Սոնա Հակոբյանը։ Հանդիպման
                            ընթացքում քննարկվել և ներկայացվել են բարձրագույն կրթության ոլորտում անգլերենի դասավանդման
                            առաջնահարթություններն ու հիմնախնդիրները Մեծ Բրիտանիայից ժամանած փորձագետների հետ։ Հաջորդ
                            երկու օրերին արդեն «Դասավանդիր հանուն հաջողության» երկօրյա համաժողովին մասնակցել են ՀԵՀ
                            կիրառական լեզվաբանության ամբիոնի դասախոսներ Լուիզա Մարաբյանը, Լիլիթ Ավետիսյանը, Արմինե
                            Զաքարյանը՝ ՀԵՀ զբոսաշրջության, լեզվաբանության և հոգեբանության ֆակուլտետի դեկան Մարինե
                            Ավետիսյանի գլխավորությամբ։ Համաժողովը վարում էին փորձագետներ Մայքլ Քոնոլին, Կասպար Մայսը և
                            Տատյանա Շլիեպչևիկը։</p>
                        <p>Հայաստանում Բրիտանական Խորհրդի նախաձեռնությամբ կազմակերված «Դասավանդիր հանուն հաջողության»
                            անգլերեն դասավանդողների համաժողովի շրջանակներում Բրիտանական խորհուրդը սույն թվականի մարտի
                            1-ին նախաձեռնել էր հանդիպում-քննարկում ՀՀ բարձրագույն ուսումնական հաստատությունների ագլերեն
                            լեզվի կրթական ծրագրերի ղեկավարների հետ։ Հանդիպմանը մասնակցում էր նաև Հայաստանի եվրոպական
                            համալսարանի կիրառական լեզվաբանության ամբիոնի վարիչ, բ.գ.թ., դոցենտ Սոնա Հակոբյանը։ Հանդիպման
                            ընթացքում քննարկվել և ներկայացվել են բարձրագույն կրթության ոլորտում անգլերենի դասավանդման
                            առաջնահարթություններն ու հիմնախնդիրները Մեծ Բրիտանիայից ժամանած փորձագետների հետ։ Հաջորդ
                            երկու օրերին արդեն «Դասավանդիր հանուն հաջողության» երկօրյա համաժողովին մասնակցել են ՀԵՀ
                            կիրառական լեզվաբանության ամբիոնի դասախոսներ Լուիզա Մարաբյանը, Լիլիթ Ավետիսյանը, Արմինե
                            Զաքարյանը՝ ՀԵՀ զբոսաշրջության, լեզվաբանության և հոգեբանության ֆակուլտետի դեկան Մարինե
                            Ավետիսյանի գլխավորությամբ։ Համաժողովը վարում էին փորձագետներ Մայքլ Քոնոլին, Կասպար Մայսը և
                            Տատյանա Շլիեպչևիկը։</p>
                        <p>Հայաստանում Բրիտանական Խորհրդի նախաձեռնությամբ կազմակերված «Դասավանդիր հանուն հաջողության»
                            անգլերեն դասավանդողների համաժողովի շրջանակներում Բրիտանական խորհուրդը սույն թվականի մարտի
                            1-ին նախաձեռնել էր հանդիպում-քննարկում ՀՀ բարձրագույն ուսումնական հաստատությունների ագլերեն
                            լեզվի կրթական ծրագրերի ղեկավարների հետ։ Հանդիպմանը մասնակցում էր նաև Հայաստանի եվրոպական
                            համալսարանի կիրառական լեզվաբանության ամբիոնի վարիչ, բ.գ.թ., դոցենտ Սոնա Հակոբյանը։ Հանդիպման
                            ընթացքում քննարկվել և ներկայացվել են բարձրագույն կրթության ոլորտում անգլերենի դասավանդման
                            առաջնահարթություններն ու հիմնախնդիրները Մեծ Բրիտանիայից ժամանած փորձագետների հետ։ Հաջորդ
                            երկու օրերին արդեն «Դասավանդիր հանուն հաջողության» երկօրյա համաժողովին մասնակցել են ՀԵՀ
                            կիրառական լեզվաբանության ամբիոնի դասախոսներ Լուիզա Մարաբյանը, Լիլիթ Ավետիսյանը, Արմինե
                            Զաքարյանը՝ ՀԵՀ զբոսաշրջության, լեզվաբանության և հոգեբանության ֆակուլտետի դեկան Մարինե
                            Ավետիսյանի գլխավորությամբ։ Համաժողովը վարում էին փորձագետներ Մայքլ Քոնոլին, Կասպար Մայսը և
                            Տատյանա Շլիեպչևիկը։</p>
                        <p>Հայաստանում Բրիտանական Խորհրդի նախաձեռնությամբ կազմակերված «Դասավանդիր հանուն հաջողության»
                            անգլերեն դասավանդողների համաժողովի շրջանակներում Բրիտանական խորհուրդը սույն թվականի մարտի
                            1-ին նախաձեռնել էր հանդիպում-քննարկում ՀՀ բարձրագույն ուսումնական հաստատությունների ագլերեն
                            լեզվի կրթական ծրագրերի ղեկավարների հետ։ Հանդիպմանը մասնակցում էր նաև Հայաստանի եվրոպական
                            համալսարանի կիրառական լեզվաբանության ամբիոնի վարիչ, բ.գ.թ., դոցենտ Սոնա Հակոբյանը։ Հանդիպման
                            ընթացքում քննարկվել և ներկայացվել են բարձրագույն կրթության ոլորտում անգլերենի դասավանդման
                            առաջնահարթություններն ու հիմնախնդիրները Մեծ Բրիտանիայից ժամանած փորձագետների հետ։ Հաջորդ
                            երկու օրերին արդեն «Դասավանդիր հանուն հաջողության» երկօրյա համաժողովին մասնակցել են ՀԵՀ
                            կիրառական լեզվաբանության ամբիոնի դասախոսներ Լուիզա Մարաբյանը, Լիլիթ Ավետիսյանը, Արմինե
                            Զաքարյանը՝ ՀԵՀ զբոսաշրջության, լեզվաբանության և հոգեբանության ֆակուլտետի դեկան Մարինե
                            Ավետիսյանի գլխավորությամբ։ Համաժողովը վարում էին փորձագետներ Մայքլ Քոնոլին, Կասպար Մայսը և
                            Տատյանա Շլիեպչևիկը։</p>

                    </div>
                    <div className={styles.otherNews}>
                        <h2>Այլ նորություններ</h2>
                        {news.map((item) => (
                            <ItemOther key={item.id} item={item}/>
                        ))}
                    </div>
                </div>
                <div className={stylesHome.row}>
                    <Gallery/>
                    <Events/>
                </div>
            </App>
        </>
    );
};

export default Title;